[
  {
    "topic": "Conditionals (If-Clauses)",
    "level": "B1/B2",
    "description": "Sıfır, Birinci, İkinci, Üçüncü ve karışık (mixed) şart cümleleri; zaman uyumu ve yaygın ifadeler.",
    "pattern": "Zero: if + present, present (genel gerçek). First: if + present, will/can/may + V1 (gelecek olasılık). Second: if + past simple, would/could + V1 (hayal/düşük olasılık). Third: if + past perfect, would/could have + V3 (geçmiş pişmanlık). Mixed: if + past perfect, would + V1 (geçmiş şart → şimdi sonuç).",
    "examples": [
      "Zero: If water boils, it turns to steam. → Su kaynarsa buhara dönüşür. (genel gerçek)",
      "First: If it rains, we’ll stay home. → Yağarsa evde kalırız. (gerçekçi olasılık)",
      "First (izin/olasılık): If you finish early, you can leave. → Erken bitirirsen çıkabilirsin.",
      "Second: If I had more time, I would learn Spanish. → Daha çok vaktim olsaydı İspanyolca öğrenirdim. (şimdi gerçek değil)",
      "Second (kibar öneri): If I were you, I’d call her. → Sen olsam onu arardım.",
      "Third: If you had told me, I would have helped. → Bana söyleseydin yardım ederdim. (geçmişte kaçırılan fırsat)",
      "Third (farklı modal): If she had left earlier, she might have caught the bus. → Daha erken çıksaydı otobüsü yakalayabilirdi.",
      "Mixed: If I had slept more, I would be energetic now. → Daha çok uyusaydım şimdi enerjik olurdum. (geçmiş şart → şimdiki sonuç)",
      "Unless = if not: Unless you study, you won’t pass. → Çalışmazsan geçemezsin.",
      "Inversion (resmî): Had I known, I would have called. → Bilseydim arardım."
    ],
    "tips": [
      "If-clause’da gelecek zaman kullanılmaz; present simple kullanılır: If it rains, **we will** stay (ana cümle).",
      "Second conditional’da **were** her özneyle kullanılabilir: If he were here… (resmî/kibar).",
      "Third conditional’da “had” + V3; ana cümlede would/could/might + have + V3.",
      "Mixed tip: geçmişte olmadı → şimdi sonucu yok: If I had studied, I would have a better job now.",
      "Unless = if not; though bazen daha kısıtlayıcıdır: Unless you hurry, you’ll miss the bus."
    ],
    "mistakes": [
      "If cümlesinde will kullanmak: If you **will come** ❌ → If you come ✅",
      "Second conditional’da gelecek karışıklığı: If I will have time ❌ → If I had time ✅",
      "Third conditional’da geçmiş zaman eksikliği: If I told you, I would have helped ❌ → If I had told you… ✅",
      "Virgül: If-clause baştaysa virgül kullan; sonda ise gerekmez: If it rains, we’ll stay / We’ll stay if it rains."
    ],
    "note": "Zaman uyumları ezber: Zero (present/present), First (present/will), Second (past/would), Third (past perfect/would have), Mixed (past perfect/would). ‘If I were you’ kalıbı kibar tavsiye için klasik bir second conditional örneğidir."
  }
]
