[{"title":"Patient Study 6-001","level":"A2","text":"Right after lunch in a small studio, our project group planned a slow walk to track progress without rushing. While the kettle boiled, I took short notes to avoid rushing at the end and every step felt lighter than before. When the door closed, the small effort felt meaningful and the sense of progress stayed with me","glossary":[{"word":"clarity","meaning":"quality of being clear"},{"word":"routine","meaning":"regular set of actions"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Steady Morning 6-002","level":"A2","text":"During a short break under tall pine trees, two classmates cooked a simple meal to notice details people often miss. As the street grew quiet, my older sister took short notes to make the group feel ready and noticed how focus slowly returned. When the page filled up, the result looked better than expected and the quiet victory tasted sweet","glossary":[{"word":"break","meaning":"short rest from activity"},{"word":"feedback","meaning":"information about how you did"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Gentle Morning 6-003","level":"B1","text":"During a calm weekend under tall pine trees, a patient mentor cleaned the messy room to clear the mind and stretch gently. Between two calls, my running partner checked the task list to make the group feel ready and every step felt lighter than before. As the lights dimmed, the space felt tidy and balanced and the calm feeling lasted into the evening","glossary":[{"word":"steady","meaning":"happening in a smooth way"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"priority","meaning":"most important thing"}]},{"title":"Patient Session 6-004","level":"A2","text":"Right after lunch on the rooftop garden, our small team prepared a careful list to feel calm before busy tasks. Between two calls, my neighbor Sam sent a careful message to keep energy steady and the quiet helped new ideas surface. When the room emptied, a quiet pride settled in and the routine turned into a personal anchor","glossary":[{"word":"progress","meaning":"forward movement toward a goal"},{"word":"steady","meaning":"happening in a smooth way"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Bright Walk 6-005","level":"A2","text":"On a quiet afternoon in the community center, our small team started a new routine to feel calm before busy tasks. In the middle, my friend Lina sent a careful message to keep energy steady and noticed how focus slowly returned. By the end, the space felt tidy and balanced and I promised to keep the same gentle tempo","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"energy","meaning":"strength to do work"},{"word":"priority","meaning":"most important thing"}]},{"title":"Focused Morning 6-006","level":"B1","text":"Before sunrise at the riverside path, my friend Lina started a new routine to track progress without rushing. When a reminder pinged, our small team refilled a cold water bottle so nothing important slipped away and the team relaxed after seeing progress. After the call ended, the mood in the room lifted and the rhythm of the day finally matched my pace","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"stamina","meaning":"strength to keep going for a long time"}]},{"title":"Bright Study 6-007","level":"A2","text":"Late in the evening beside the old bridge, my older sister planned a slow walk to track progress without rushing. While working, I timed a quick stretch to keep the goal visible and felt the tension leave my shoulders. After the call ended, the main goal felt reachable and my mind stayed open for new ideas","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"break","meaning":"short rest from activity"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Bright Practice 6-008","level":"B2","text":"After a long day near the crowded station, our project group prepared a careful list to make space for focused study. When the room got warm, my running partner refilled a cold water bottle to avoid rushing at the end and felt the tension leave my shoulders. By the end, the main goal felt reachable and the sense of progress stayed with me","glossary":[{"word":"commitment","meaning":"promise to do something"},{"word":"break","meaning":"short rest from activity"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Bold Evening 6-009","level":"B2","text":"On a quiet afternoon at the riverside path, a curious visitor planned a slow walk to slow down and breathe steadily. In the middle, our small team shared a calm laugh to prevent small mistakes and kept the room calm and clear. As the lights dimmed, every step felt slower and clearer and even the hard parts felt manageable","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"strategy","meaning":"plan to reach a goal"},{"word":"revision","meaning":"changing something to improve it"}]},{"title":"Bold Check-in 6-010","level":"B2","text":"During a calm weekend near the crowded station, my older sister reviewed a long article to notice details people often miss. After a pause, our small team took short notes so feedback could be gentle and the hour passed without stress. When the work finished, there was still energy for a walk and I promised to keep the same gentle tempo","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Evolving Study 6-011","level":"B2","text":"On a quiet afternoon in the community center, I organized the scattered notes to enjoy the quiet street outside. While working, our project group refilled a cold water bottle to prevent small mistakes and the plan finally made sense. As the lights dimmed, the next task looked simple and the quiet victory tasted sweet","glossary":[{"word":"revision","meaning":"changing something to improve it"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"pace","meaning":"speed of movement or progress"}]},{"title":"Evolving Walk 6-012","level":"A2","text":"On a windy night on the rooftop garden, a curious visitor tested a fresh recipe to make space for focused study. In the middle, my running partner saved a draft copy so nothing important slipped away and the team relaxed after seeing progress. When the page filled up, the main goal felt reachable and even the hard parts felt manageable","glossary":[{"word":"steady","meaning":"happening in a smooth way"},{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Focused Routine 6-013","level":"B1","text":"On a quiet afternoon in a sunny kitchen, our project group cooked a simple meal to slow down and breathe steadily. As the street grew quiet, my running partner took short notes to protect extra time for breaks and noticed how focus slowly returned. Once the list was done, the next task looked simple and the routine turned into a personal anchor","glossary":[{"word":"priority","meaning":"most important thing"},{"word":"habit","meaning":"action done regularly"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Evolving Morning 6-014","level":"B1","text":"Late in the evening in the community center, my friend Lina prepared a careful list to enjoy the quiet street outside. After a pause, my neighbor Sam reviewed the main idea to protect extra time for breaks and felt the tension leave my shoulders. When the page filled up, the result looked better than expected and the routine turned into a personal anchor","glossary":[{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"steady","meaning":"happening in a smooth way"},{"word":"feedback","meaning":"information about how you did"}]},{"title":"Bright Morning 6-015","level":"B2","text":"Before sunrise under tall pine trees, my older sister started a new routine to slow down and breathe steadily. While the kettle boiled, a curious visitor sent a careful message so the plan stayed realistic and the hour passed without stress. After the timer rang, it was easy to breathe deeply and I knew I could repeat this habit tomorrow","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"habit","meaning":"action done regularly"},{"word":"feedback","meaning":"information about how you did"}]},{"title":"Gentle Reset 6-016","level":"B1","text":"Early in the morning at the riverside path, my running partner prepared a careful list to spot patterns in daily habits. As the street grew quiet, my older sister adjusted the schedule to highlight the biggest risk and the team relaxed after seeing progress. When the room emptied, the next task looked simple and I knew I could repeat this habit tomorrow","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"habit","meaning":"action done regularly"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Evolving Walk 6-017","level":"B1","text":"During a calm weekend beside the old bridge, two classmates sketched a bold idea to understand a difficult topic. While working, my older sister adjusted the schedule to protect extra time for breaks and every step felt lighter than before. As the lights dimmed, there was still energy for a walk and the rhythm of the day finally matched my pace","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"reflection","meaning":"thinking carefully about something"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Gentle Walk 6-018","level":"A2","text":"During a short break beside the old bridge, my older sister reviewed a long article to clear the mind and stretch gently. As the street grew quiet, my neighbor Sam saved a draft copy so the plan stayed realistic and every step felt lighter than before. Once the list was done, the mood in the room lifted and I knew I could repeat this habit tomorrow","glossary":[{"word":"priority","meaning":"most important thing"},{"word":"focus","meaning":"attention on one thing"},{"word":"habit","meaning":"action done regularly"}]},{"title":"Bold Reset 6-019","level":"B2","text":"During a short break on the rooftop garden, a patient mentor cleaned the messy room to slow down and breathe steadily. While the music played, our project group saved a draft copy to highlight the biggest risk and the notes looked surprisingly neat. As the lights dimmed, it was easy to breathe deeply and I knew I could repeat this habit tomorrow","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"balanced","meaning":"evenly arranged; stable"}]},{"title":"Calm Morning 6-020","level":"A2","text":"During a short break beside the old bridge, my neighbor Sam planned a slow walk to feel calm before busy tasks. While working, my neighbor Sam timed a quick stretch so the plan stayed realistic and felt the tension leave my shoulders. When the room emptied, a quiet pride settled in and my mind stayed open for new ideas","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"habit","meaning":"action done regularly"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Evolving Check-in 6-021","level":"B2","text":"On a windy night on the rooftop garden, two classmates tested a fresh recipe to make space for focused study. Between two calls, my older sister reviewed the main idea so nothing important slipped away and the team relaxed after seeing progress. Once the list was done, the main goal felt reachable and my mind stayed open for new ideas","glossary":[{"word":"clarity","meaning":"quality of being clear"},{"word":"routine","meaning":"regular set of actions"},{"word":"stamina","meaning":"strength to keep going for a long time"}]},{"title":"Calm Evening 6-022","level":"B1","text":"Late in the evening inside the city library, my older sister tested a fresh recipe to make space for focused study. While the kettle boiled, my friend Lina sent a careful message to keep the goal visible and the plan finally made sense. As the sun set, a quiet pride settled in and even the hard parts felt manageable","glossary":[{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"priority","meaning":"most important thing"}]},{"title":"Quiet Check-in 6-023","level":"B2","text":"During a calm weekend in a sunny kitchen, I tested a fresh recipe to spot patterns in daily habits. While working, our project group checked the task list so feedback could be gentle and the quiet helped new ideas surface. When the page filled up, the next task looked simple and my mind stayed open for new ideas","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"clarity","meaning":"quality of being clear"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Bright Evening 6-024","level":"A2","text":"During a short break near the crowded station, a curious visitor cooked a simple meal to understand a difficult topic. While the music played, our small team checked the task list to keep energy steady and kept the room calm and clear. When the work finished, the main goal felt reachable and I knew I could repeat this habit tomorrow","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"revision","meaning":"changing something to improve it"}]},{"title":"Clear Check-in 6-025","level":"B1","text":"On a windy night inside the city library, our small team planned a slow walk to understand a difficult topic. While working, my friend Lina adjusted the schedule to prevent small mistakes and the quiet helped new ideas surface. After the call ended, the result looked better than expected and confidence grew one careful piece at a time","glossary":[{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"focus","meaning":"attention on one thing"},{"word":"energy","meaning":"strength to do work"}]},{"title":"Bold Session 6-026","level":"B1","text":"During a short break inside a noisy café, a patient mentor organized the scattered notes to understand a difficult topic. After a pause, our small team saved a draft copy so feedback could be gentle and the process felt almost playful. By the end, the space felt tidy and balanced and I knew I could repeat this habit tomorrow","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Gentle Practice 6-027","level":"B1","text":"On a quiet afternoon in a small studio, our small team recorded a practice speech to make space for focused study. As the street grew quiet, a curious visitor timed a quick stretch to highlight the biggest risk and every step felt lighter than before. When the page filled up, the space felt tidy and balanced and my mind stayed open for new ideas","glossary":[{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"feedback","meaning":"information about how you did"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Gentle Evening 6-028","level":"A2","text":"Early in the morning near the crowded station, our small team started a new routine to track progress without rushing. As the rain stopped, our project group reviewed the main idea to make the group feel ready and the plan finally made sense. After the call ended, a quiet pride settled in and the routine turned into a personal anchor","glossary":[{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"routine","meaning":"regular set of actions"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Focused Study 6-029","level":"B1","text":"During a short break in the community center, our project group prepared a careful list to spot patterns in daily habits. While the music played, my friend Lina took short notes to highlight the biggest risk and the process felt almost playful. As the sun set, the space felt tidy and balanced and the calm feeling lasted into the evening","glossary":[{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"focus","meaning":"attention on one thing"},{"word":"pace","meaning":"speed of movement or progress"}]},{"title":"Clear Evening 6-030","level":"B2","text":"During a calm weekend beside the old bridge, a curious visitor sketched a bold idea to slow down and breathe steadily. While the music played, a patient mentor refilled a cold water bottle so nothing important slipped away and the team relaxed after seeing progress. When the room emptied, the result looked better than expected and the calm feeling lasted into the evening","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"revision","meaning":"changing something to improve it"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Evolving Routine 6-031","level":"B1","text":"On a quiet afternoon in the community center, our small team tested a fresh recipe to notice details people often miss. While working, my neighbor Sam adjusted the schedule to make the group feel ready and the plan finally made sense. After the timer rang, the next task looked simple and the rhythm of the day finally matched my pace","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"energy","meaning":"strength to do work"},{"word":"strategy","meaning":"plan to reach a goal"}]},{"title":"Clear Practice 6-032","level":"B2","text":"Late in the evening at the riverside path, my running partner tested a fresh recipe to track progress without rushing. When the room got warm, our project group saved a draft copy to keep the goal visible and kept the room calm and clear. After the timer rang, it was easy to breathe deeply and confidence grew one careful piece at a time","glossary":[{"word":"progress","meaning":"forward movement toward a goal"},{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Quiet Walk 6-033","level":"A2","text":"During a calm weekend under tall pine trees, two classmates cooked a simple meal to slow down and breathe steadily. When the room got warm, my friend Lina timed a quick stretch to avoid rushing at the end and kept the room calm and clear. When the page filled up, the mood in the room lifted and confidence grew one careful piece at a time","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"habit","meaning":"action done regularly"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Calm Practice 6-034","level":"A2","text":"During a short break inside a noisy café, my older sister prepared a careful list to notice details people often miss. As the street grew quiet, our small team took short notes so the plan stayed realistic and the hour passed without stress. When the work finished, the space felt tidy and balanced and even the hard parts felt manageable","glossary":[{"word":"habit","meaning":"action done regularly"},{"word":"revision","meaning":"changing something to improve it"},{"word":"priority","meaning":"most important thing"}]},{"title":"Bold Session 6-035","level":"B2","text":"On a windy night beside the old bridge, my running partner tested a fresh recipe to feel calm before busy tasks. Between two calls, a curious visitor sent a careful message to prevent small mistakes and the process felt almost playful. Once the list was done, the result looked better than expected and the quiet victory tasted sweet","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Bold Morning 6-036","level":"B1","text":"Just before a meeting on the rooftop garden, I planned a slow walk to see how light changed every corner. After a pause, my older sister timed a quick stretch to keep energy steady and the hour passed without stress. When the door closed, it was easy to breathe deeply and the rhythm of the day finally matched my pace","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Calm Study 6-037","level":"B2","text":"On a quiet afternoon under tall pine trees, my older sister reviewed a long article to spot patterns in daily habits. When the room got warm, my running partner took short notes to highlight the biggest risk and the notes looked surprisingly neat. After the call ended, the mood in the room lifted and I knew I could repeat this habit tomorrow","glossary":[{"word":"commitment","meaning":"promise to do something"},{"word":"focus","meaning":"attention on one thing"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Bright Routine 6-038","level":"B1","text":"Early in the morning in a sunny kitchen, my running partner prepared a careful list to feel calm before busy tasks. In the middle, two classmates reviewed the main idea so nothing important slipped away and the quiet helped new ideas surface. As the lights dimmed, the mood in the room lifted and even the hard parts felt manageable","glossary":[{"word":"feedback","meaning":"information about how you did"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Patient Evening 6-039","level":"B2","text":"Early in the morning on the rooftop garden, my running partner organized the scattered notes to spot patterns in daily habits. While working, my older sister took short notes to highlight the biggest risk and the hour passed without stress. After the call ended, there was still energy for a walk and confidence grew one careful piece at a time","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"feedback","meaning":"information about how you did"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Quiet Session 6-040","level":"B1","text":"On a quiet afternoon in a small studio, a curious visitor cleaned the messy room to clear the mind and stretch gently. When a reminder pinged, a curious visitor took short notes so feedback could be gentle and the hour passed without stress. After the call ended, a quiet pride settled in and the calm feeling lasted into the evening","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"commitment","meaning":"promise to do something"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Steady Morning 6-041","level":"B1","text":"After a long day inside the city library, a patient mentor sketched a bold idea to clear the mind and stretch gently. While the kettle boiled, a patient mentor timed a quick stretch to keep the goal visible and kept the room calm and clear. As the lights dimmed, there was still energy for a walk and the sense of progress stayed with me","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Steady Practice 6-042","level":"B2","text":"Just before a meeting near the crowded station, I tested a fresh recipe to spot patterns in daily habits. When a reminder pinged, my older sister sent a careful message to keep energy steady and the process felt almost playful. When the work finished, the space felt tidy and balanced and confidence grew one careful piece at a time","glossary":[{"word":"steady","meaning":"happening in a smooth way"},{"word":"habit","meaning":"action done regularly"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Clear Session 6-043","level":"B1","text":"Early in the morning at the riverside path, my running partner planned a slow walk to enjoy the quiet street outside. While the kettle boiled, my neighbor Sam took short notes so nothing important slipped away and felt the tension leave my shoulders. Once the list was done, the space felt tidy and balanced and my mind stayed open for new ideas","glossary":[{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"priority","meaning":"most important thing"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Bold Study 6-044","level":"B1","text":"During a short break on the rooftop garden, my neighbor Sam organized the scattered notes to clear the mind and stretch gently. After a pause, my older sister adjusted the schedule to protect extra time for breaks and the plan finally made sense. After the call ended, the mood in the room lifted and the routine turned into a personal anchor","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"break","meaning":"short rest from activity"},{"word":"pace","meaning":"speed of movement or progress"}]},{"title":"Calm Evening 6-045","level":"B2","text":"Right after lunch in the community center, I sketched a bold idea to track progress without rushing. Between two calls, our project group timed a quick stretch so nothing important slipped away and felt the tension leave my shoulders. Once the list was done, the main goal felt reachable and the calm feeling lasted into the evening","glossary":[{"word":"progress","meaning":"forward movement toward a goal"},{"word":"commitment","meaning":"promise to do something"},{"word":"focus","meaning":"attention on one thing"}]},{"title":"Quiet Evening 6-046","level":"B1","text":"Just before a meeting near the crowded station, my running partner recorded a practice speech to make space for focused study. After a pause, my friend Lina saved a draft copy to make the group feel ready and the process felt almost playful. When the door closed, it was easy to breathe deeply and the rhythm of the day finally matched my pace","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"pace","meaning":"speed of movement or progress"}]},{"title":"Clear Check-in 6-047","level":"A2","text":"On a windy night inside the city library, my friend Lina recorded a practice speech to slow down and breathe steadily. As the rain stopped, our small team timed a quick stretch to highlight the biggest risk and the plan finally made sense. When the door closed, it was easy to breathe deeply and I promised to keep the same gentle tempo","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"habit","meaning":"action done regularly"},{"word":"calm","meaning":"without strong emotion; peaceful"}]},{"title":"Calm Practice 6-048","level":"B2","text":"After a long day under tall pine trees, my older sister organized the scattered notes to see how light changed every corner. While the music played, my running partner reviewed the main idea to protect extra time for breaks and the notes looked surprisingly neat. After the timer rang, it was easy to breathe deeply and the quiet victory tasted sweet","glossary":[{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"tempo","meaning":"speed of rhythm or action"}]},{"title":"Calm Reset 6-049","level":"B1","text":"Early in the morning under tall pine trees, a curious visitor sketched a bold idea to spot patterns in daily habits. As the street grew quiet, I adjusted the schedule so nothing important slipped away and the quiet helped new ideas surface. By the end, every step felt slower and clearer and the routine turned into a personal anchor","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"strategy","meaning":"plan to reach a goal"}]},{"title":"Gentle Check-in 6-050","level":"A2","text":"Just before a meeting near the crowded station, a patient mentor started a new routine to spot patterns in daily habits. After a pause, my older sister checked the task list to avoid rushing at the end and the notes looked surprisingly neat. When the page filled up, the result looked better than expected and the rhythm of the day finally matched my pace","glossary":[{"word":"strategy","meaning":"plan to reach a goal"},{"word":"priority","meaning":"most important thing"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Gentle Practice 6-051","level":"B1","text":"After a long day at the riverside path, my friend Lina planned a slow walk to spot patterns in daily habits. As the rain stopped, a patient mentor refilled a cold water bottle to make the group feel ready and the hour passed without stress. When the page filled up, the next task looked simple and the rhythm of the day finally matched my pace","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"revision","meaning":"changing something to improve it"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Gentle Routine 6-052","level":"B1","text":"Just before a meeting in a small studio, a curious visitor prepared a careful list to see how light changed every corner. Between two calls, our project group adjusted the schedule to keep energy steady and the quiet helped new ideas surface. After the timer rang, a quiet pride settled in and the routine turned into a personal anchor","glossary":[{"word":"commitment","meaning":"promise to do something"},{"word":"break","meaning":"short rest from activity"},{"word":"focus","meaning":"attention on one thing"}]},{"title":"Patient Morning 6-053","level":"B2","text":"Late in the evening in a small studio, a curious visitor prepared a careful list to feel calm before busy tasks. After a pause, my older sister timed a quick stretch to highlight the biggest risk and noticed how focus slowly returned. When the page filled up, it was easy to breathe deeply and the quiet victory tasted sweet","glossary":[{"word":"habit","meaning":"action done regularly"},{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Focused Walk 6-054","level":"B2","text":"During a calm weekend beside the old bridge, a curious visitor prepared a careful list to spot patterns in daily habits. When a reminder pinged, our small team refilled a cold water bottle to make the group feel ready and kept the room calm and clear. When the room emptied, the next task looked simple and I knew I could repeat this habit tomorrow","glossary":[{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"priority","meaning":"most important thing"}]},{"title":"Clear Practice 6-055","level":"B2","text":"Right after lunch under tall pine trees, our project group tested a fresh recipe to slow down and breathe steadily. As the rain stopped, two classmates took short notes to prevent small mistakes and noticed how focus slowly returned. After the call ended, the mood in the room lifted and the quiet victory tasted sweet","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Calm Hour 6-056","level":"B1","text":"Late in the evening under tall pine trees, my older sister cooked a simple meal to clear the mind and stretch gently. After a pause, two classmates refilled a cold water bottle to protect extra time for breaks and kept the room calm and clear. When the work finished, every step felt slower and clearer and even the hard parts felt manageable","glossary":[{"word":"feedback","meaning":"information about how you did"},{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"clarity","meaning":"quality of being clear"}]},{"title":"Evolving Study 6-057","level":"A2","text":"Before sunrise on the rooftop garden, a patient mentor sketched a bold idea to slow down and breathe steadily. While the music played, our small team adjusted the schedule to prevent small mistakes and noticed how focus slowly returned. When the door closed, the mood in the room lifted and the calm feeling lasted into the evening","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"balanced","meaning":"evenly arranged; stable"}]},{"title":"Evolving Walk 6-058","level":"B1","text":"Early in the morning in the community center, I recorded a practice speech to notice details people often miss. While the music played, two classmates refilled a cold water bottle to prevent small mistakes and kept the room calm and clear. As the sun set, the space felt tidy and balanced and the rhythm of the day finally matched my pace","glossary":[{"word":"break","meaning":"short rest from activity"},{"word":"focus","meaning":"attention on one thing"},{"word":"stamina","meaning":"strength to keep going for a long time"}]},{"title":"Clear Hour 6-059","level":"A2","text":"On a windy night inside the city library, a curious visitor cooked a simple meal to track progress without rushing. While the kettle boiled, our small team shared a calm laugh so nothing important slipped away and the hour passed without stress. When the room emptied, a quiet pride settled in and the quiet victory tasted sweet","glossary":[{"word":"commitment","meaning":"promise to do something"},{"word":"feedback","meaning":"information about how you did"},{"word":"pace","meaning":"speed of movement or progress"}]},{"title":"Bold Session 6-060","level":"B2","text":"On a quiet afternoon inside a noisy café, two classmates cleaned the messy room to make space for focused study. When the room got warm, my neighbor Sam saved a draft copy to keep energy steady and felt the tension leave my shoulders. By the end, the result looked better than expected and the routine turned into a personal anchor","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Evolving Session 6-061","level":"B2","text":"During a short break near the crowded station, a patient mentor cooked a simple meal to understand a difficult topic. Between two calls, our small team refilled a cold water bottle to avoid rushing at the end and the notes looked surprisingly neat. After the call ended, every step felt slower and clearer and the quiet victory tasted sweet","glossary":[{"word":"revision","meaning":"changing something to improve it"},{"word":"priority","meaning":"most important thing"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Clear Routine 6-062","level":"B1","text":"Late in the evening near the crowded station, a patient mentor sketched a bold idea to make space for focused study. In the middle, my friend Lina took short notes so feedback could be gentle and the hour passed without stress. After the timer rang, it was easy to breathe deeply and my mind stayed open for new ideas","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"progress","meaning":"forward movement toward a goal"},{"word":"priority","meaning":"most important thing"}]},{"title":"Evolving Evening 6-063","level":"A2","text":"During a calm weekend under tall pine trees, my running partner recorded a practice speech to clear the mind and stretch gently. Between two calls, my friend Lina reviewed the main idea so nothing important slipped away and the notes looked surprisingly neat. Once the list was done, it was easy to breathe deeply and the quiet victory tasted sweet","glossary":[{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"habit","meaning":"action done regularly"},{"word":"focus","meaning":"attention on one thing"}]},{"title":"Focused Practice 6-064","level":"A2","text":"Right after lunch at the riverside path, I cleaned the messy room to clear the mind and stretch gently. In the middle, two classmates sent a careful message to avoid rushing at the end and the process felt almost playful. As the lights dimmed, every step felt slower and clearer and confidence grew one careful piece at a time","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"feedback","meaning":"information about how you did"},{"word":"tempo","meaning":"speed of rhythm or action"}]},{"title":"Clear Hour 6-065","level":"A2","text":"On a quiet afternoon in the community center, two classmates organized the scattered notes to spot patterns in daily habits. While the music played, our project group checked the task list so the plan stayed realistic and the notes looked surprisingly neat. After the timer rang, a quiet pride settled in and I promised to keep the same gentle tempo","glossary":[{"word":"priority","meaning":"most important thing"},{"word":"habit","meaning":"action done regularly"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Bright Reset 6-066","level":"B1","text":"Right after lunch in a sunny kitchen, our small team cleaned the messy room to understand a difficult topic. In the middle, my older sister refilled a cold water bottle so feedback could be gentle and kept the room calm and clear. After the call ended, the main goal felt reachable and even the hard parts felt manageable","glossary":[{"word":"clarity","meaning":"quality of being clear"},{"word":"habit","meaning":"action done regularly"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Focused Practice 6-067","level":"B1","text":"After a long day in a sunny kitchen, a patient mentor cleaned the messy room to track progress without rushing. In the middle, two classmates sent a careful message to highlight the biggest risk and the process felt almost playful. When the door closed, the space felt tidy and balanced and the sense of progress stayed with me","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"steady","meaning":"happening in a smooth way"},{"word":"balanced","meaning":"evenly arranged; stable"}]},{"title":"Focused Routine 6-068","level":"B1","text":"Just before a meeting on the rooftop garden, our small team planned a slow walk to feel calm before busy tasks. While the music played, my older sister timed a quick stretch to protect extra time for breaks and the quiet helped new ideas surface. After the call ended, the small effort felt meaningful and my mind stayed open for new ideas","glossary":[{"word":"habit","meaning":"action done regularly"},{"word":"routine","meaning":"regular set of actions"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Patient Hour 6-069","level":"A2","text":"Late in the evening in the community center, two classmates recorded a practice speech to make space for focused study. When the room got warm, our small team saved a draft copy so feedback could be gentle and felt the tension leave my shoulders. After the call ended, it was easy to breathe deeply and even the hard parts felt manageable","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"reflection","meaning":"thinking carefully about something"}]},{"title":"Focused Hour 6-070","level":"B1","text":"During a short break near the crowded station, our small team planned a slow walk to slow down and breathe steadily. Between two calls, two classmates saved a draft copy so the plan stayed realistic and the quiet helped new ideas surface. After the call ended, there was still energy for a walk and confidence grew one careful piece at a time","glossary":[{"word":"insight","meaning":"deep understanding of something"},{"word":"break","meaning":"short rest from activity"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Bold Walk 6-071","level":"B1","text":"During a calm weekend inside a noisy café, I cooked a simple meal to enjoy the quiet street outside. When the room got warm, a curious visitor sent a careful message to avoid rushing at the end and the notes looked surprisingly neat. After the timer rang, the mood in the room lifted and the quiet victory tasted sweet","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"reflection","meaning":"thinking carefully about something"},{"word":"calm","meaning":"without strong emotion; peaceful"}]},{"title":"Patient Walk 6-072","level":"B1","text":"On a windy night under tall pine trees, two classmates tested a fresh recipe to notice details people often miss. Between two calls, my friend Lina shared a calm laugh to protect extra time for breaks and noticed how focus slowly returned. When the page filled up, every step felt slower and clearer and the sense of progress stayed with me","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"revision","meaning":"changing something to improve it"}]},{"title":"Bright Check-in 6-073","level":"B1","text":"Before sunrise on the rooftop garden, our small team sketched a bold idea to notice details people often miss. After a pause, a patient mentor timed a quick stretch to highlight the biggest risk and felt the tension leave my shoulders. When the page filled up, the small effort felt meaningful and the sense of progress stayed with me","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"habit","meaning":"action done regularly"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Steady Hour 6-074","level":"B1","text":"Late in the evening inside a noisy café, my older sister reviewed a long article to feel calm before busy tasks. While the music played, my friend Lina refilled a cold water bottle to highlight the biggest risk and the hour passed without stress. When the room emptied, the main goal felt reachable and I knew I could repeat this habit tomorrow","glossary":[{"word":"break","meaning":"short rest from activity"},{"word":"commitment","meaning":"promise to do something"},{"word":"stamina","meaning":"strength to keep going for a long time"}]},{"title":"Calm Reset 6-075","level":"B2","text":"Right after lunch under tall pine trees, our project group reviewed a long article to slow down and breathe steadily. As the street grew quiet, my friend Lina timed a quick stretch to highlight the biggest risk and the notes looked surprisingly neat. When the room emptied, it was easy to breathe deeply and even the hard parts felt manageable","glossary":[{"word":"clarity","meaning":"quality of being clear"},{"word":"revision","meaning":"changing something to improve it"},{"word":"feedback","meaning":"information about how you did"}]},{"title":"Clear Hour 6-076","level":"B2","text":"During a calm weekend near the crowded station, a curious visitor recorded a practice speech to make space for focused study. Between two calls, a patient mentor saved a draft copy to keep the goal visible and noticed how focus slowly returned. Once the list was done, the main goal felt reachable and confidence grew one careful piece at a time","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"energy","meaning":"strength to do work"},{"word":"priority","meaning":"most important thing"}]},{"title":"Calm Practice 6-077","level":"A2","text":"After a long day in a small studio, our project group started a new routine to see how light changed every corner. Between two calls, my friend Lina sent a careful message so nothing important slipped away and every step felt lighter than before. As the sun set, every step felt slower and clearer and the rhythm of the day finally matched my pace","glossary":[{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"steady","meaning":"happening in a smooth way"},{"word":"energy","meaning":"strength to do work"}]},{"title":"Patient Reset 6-078","level":"B2","text":"Just before a meeting inside a noisy café, a curious visitor cleaned the messy room to clear the mind and stretch gently. While the music played, a patient mentor asked clear questions to highlight the biggest risk and felt the tension leave my shoulders. After the call ended, every step felt slower and clearer and I promised to keep the same gentle tempo","glossary":[{"word":"habit","meaning":"action done regularly"},{"word":"revision","meaning":"changing something to improve it"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Quiet Hour 6-079","level":"B1","text":"After a long day inside a noisy café, my friend Lina planned a slow walk to spot patterns in daily habits. Between two calls, a curious visitor adjusted the schedule so nothing important slipped away and the team relaxed after seeing progress. By the end, the small effort felt meaningful and confidence grew one careful piece at a time","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"habit","meaning":"action done regularly"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Patient Practice 6-080","level":"B1","text":"Early in the morning beside the old bridge, our small team started a new routine to slow down and breathe steadily. While working, our small team asked clear questions to avoid rushing at the end and the hour passed without stress. As the lights dimmed, it was easy to breathe deeply and the calm feeling lasted into the evening","glossary":[{"word":"steady","meaning":"happening in a smooth way"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"feedback","meaning":"information about how you did"}]},{"title":"Evolving Morning 6-081","level":"B2","text":"On a windy night in a sunny kitchen, I cleaned the messy room to see how light changed every corner. When the room got warm, my neighbor Sam shared a calm laugh to prevent small mistakes and noticed how focus slowly returned. Once the list was done, the space felt tidy and balanced and the routine turned into a personal anchor","glossary":[{"word":"break","meaning":"short rest from activity"},{"word":"energy","meaning":"strength to do work"},{"word":"revision","meaning":"changing something to improve it"}]},{"title":"Clear Walk 6-082","level":"A2","text":"On a windy night inside the city library, our project group cleaned the messy room to make space for focused study. After a pause, my running partner took short notes to make the group feel ready and the notes looked surprisingly neat. When the page filled up, every step felt slower and clearer and I promised to keep the same gentle tempo","glossary":[{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"routine","meaning":"regular set of actions"},{"word":"stamina","meaning":"strength to keep going for a long time"}]},{"title":"Steady Hour 6-083","level":"A2","text":"After a long day in a sunny kitchen, I prepared a careful list to understand a difficult topic. While the music played, my older sister adjusted the schedule to highlight the biggest risk and the plan finally made sense. After the call ended, a quiet pride settled in and my mind stayed open for new ideas","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"habit","meaning":"action done regularly"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Focused Routine 6-084","level":"B2","text":"On a windy night in a sunny kitchen, my friend Lina cooked a simple meal to see how light changed every corner. In the middle, my older sister adjusted the schedule so feedback could be gentle and the team relaxed after seeing progress. As the lights dimmed, the small effort felt meaningful and the sense of progress stayed with me","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"feedback","meaning":"information about how you did"},{"word":"insight","meaning":"deep understanding of something"}]},{"title":"Bright Hour 6-085","level":"B1","text":"On a quiet afternoon in the community center, I sketched a bold idea to make space for focused study. While the music played, a curious visitor checked the task list so nothing important slipped away and noticed how focus slowly returned. As the sun set, the result looked better than expected and I promised to keep the same gentle tempo","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"focus","meaning":"attention on one thing"},{"word":"energy","meaning":"strength to do work"}]},{"title":"Gentle Study 6-086","level":"A2","text":"On a windy night inside a noisy café, my older sister tested a fresh recipe to enjoy the quiet street outside. As the rain stopped, I saved a draft copy to protect extra time for breaks and felt the tension leave my shoulders. After the timer rang, the main goal felt reachable and my mind stayed open for new ideas","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"feedback","meaning":"information about how you did"}]},{"title":"Bold Walk 6-087","level":"A2","text":"Right after lunch on the rooftop garden, a curious visitor started a new routine to feel calm before busy tasks. As the street grew quiet, our small team reviewed the main idea so feedback could be gentle and the plan finally made sense. When the room emptied, the main goal felt reachable and my mind stayed open for new ideas","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"break","meaning":"short rest from activity"},{"word":"tempo","meaning":"speed of rhythm or action"}]},{"title":"Clear Study 6-088","level":"A2","text":"During a calm weekend in the community center, a curious visitor sketched a bold idea to see how light changed every corner. As the rain stopped, my older sister shared a calm laugh so the plan stayed realistic and the team relaxed after seeing progress. As the sun set, the space felt tidy and balanced and the rhythm of the day finally matched my pace","glossary":[{"word":"routine","meaning":"regular set of actions"},{"word":"reflection","meaning":"thinking carefully about something"},{"word":"steady","meaning":"happening in a smooth way"}]},{"title":"Gentle Study 6-089","level":"B1","text":"After a long day in a sunny kitchen, my neighbor Sam tested a fresh recipe to notice details people often miss. When the room got warm, my friend Lina refilled a cold water bottle to prevent small mistakes and the notes looked surprisingly neat. When the work finished, the main goal felt reachable and the routine turned into a personal anchor","glossary":[{"word":"progress","meaning":"forward movement toward a goal"},{"word":"habit","meaning":"action done regularly"},{"word":"reflection","meaning":"thinking carefully about something"}]},{"title":"Calm Check-in 6-090","level":"B2","text":"Late in the evening on the rooftop garden, our project group sketched a bold idea to notice details people often miss. While working, two classmates took short notes to prevent small mistakes and the hour passed without stress. After the call ended, the space felt tidy and balanced and the quiet victory tasted sweet","glossary":[{"word":"focus","meaning":"attention on one thing"},{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"commitment","meaning":"promise to do something"}]},{"title":"Bold Morning 6-091","level":"B1","text":"On a quiet afternoon at the riverside path, I organized the scattered notes to clear the mind and stretch gently. Between two calls, our project group refilled a cold water bottle to prevent small mistakes and the quiet helped new ideas surface. After the call ended, the space felt tidy and balanced and I promised to keep the same gentle tempo","glossary":[{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"insight","meaning":"deep understanding of something"},{"word":"reflection","meaning":"thinking carefully about something"}]},{"title":"Evolving Reset 6-092","level":"B1","text":"Before sunrise in the community center, a patient mentor reviewed a long article to make space for focused study. After a pause, my neighbor Sam saved a draft copy to make the group feel ready and the plan finally made sense. When the room emptied, the small effort felt meaningful and my mind stayed open for new ideas","glossary":[{"word":"commitment","meaning":"promise to do something"},{"word":"insight","meaning":"deep understanding of something"},{"word":"priority","meaning":"most important thing"}]},{"title":"Calm Reset 6-093","level":"B1","text":"Right after lunch in a small studio, our project group planned a slow walk to feel calm before busy tasks. While the kettle boiled, our small team reviewed the main idea so the plan stayed realistic and kept the room calm and clear. Once the list was done, the result looked better than expected and the rhythm of the day finally matched my pace","glossary":[{"word":"tempo","meaning":"speed of rhythm or action"},{"word":"insight","meaning":"deep understanding of something"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Bright Walk 6-094","level":"B1","text":"Just before a meeting on the rooftop garden, my running partner prepared a careful list to feel calm before busy tasks. As the rain stopped, two classmates shared a calm laugh to protect extra time for breaks and the hour passed without stress. By the end, the small effort felt meaningful and I promised to keep the same gentle tempo","glossary":[{"word":"habit","meaning":"action done regularly"},{"word":"stamina","meaning":"strength to keep going for a long time"},{"word":"balanced","meaning":"evenly arranged; stable"}]},{"title":"Gentle Routine 6-095","level":"A2","text":"Right after lunch near the crowded station, my friend Lina sketched a bold idea to clear the mind and stretch gently. As the rain stopped, I adjusted the schedule so nothing important slipped away and felt the tension leave my shoulders. After the call ended, the next task looked simple and I promised to keep the same gentle tempo","glossary":[{"word":"pace","meaning":"speed of movement or progress"},{"word":"commitment","meaning":"promise to do something"},{"word":"break","meaning":"short rest from activity"}]},{"title":"Clear Study 6-096","level":"A2","text":"During a short break inside the city library, my running partner organized the scattered notes to see how light changed every corner. While working, a patient mentor timed a quick stretch to prevent small mistakes and the quiet helped new ideas surface. As the sun set, the mood in the room lifted and confidence grew one careful piece at a time","glossary":[{"word":"insight","meaning":"deep understanding of something"},{"word":"balanced","meaning":"evenly arranged; stable"},{"word":"revision","meaning":"changing something to improve it"}]},{"title":"Quiet Reset 6-097","level":"B1","text":"Just before a meeting beside the old bridge, our project group organized the scattered notes to clear the mind and stretch gently. While the kettle boiled, two classmates adjusted the schedule to protect extra time for breaks and the process felt almost playful. As the lights dimmed, the space felt tidy and balanced and even the hard parts felt manageable","glossary":[{"word":"energy","meaning":"strength to do work"},{"word":"pace","meaning":"speed of movement or progress"},{"word":"routine","meaning":"regular set of actions"}]},{"title":"Bright Hour 6-098","level":"A2","text":"On a quiet afternoon at the riverside path, I tested a fresh recipe to see how light changed every corner. As the street grew quiet, our small team took short notes to protect extra time for breaks and the hour passed without stress. After the timer rang, the space felt tidy and balanced and even the hard parts felt manageable","glossary":[{"word":"reflection","meaning":"thinking carefully about something"},{"word":"focus","meaning":"attention on one thing"},{"word":"balanced","meaning":"evenly arranged; stable"}]},{"title":"Patient Practice 6-099","level":"A2","text":"After a long day near the crowded station, I cooked a simple meal to enjoy the quiet street outside. After a pause, my older sister sent a careful message to highlight the biggest risk and felt the tension leave my shoulders. As the lights dimmed, the small effort felt meaningful and I promised to keep the same gentle tempo","glossary":[{"word":"calm","meaning":"without strong emotion; peaceful"},{"word":"strategy","meaning":"plan to reach a goal"},{"word":"progress","meaning":"forward movement toward a goal"}]},{"title":"Steady Hour 6-100","level":"B2","text":"Right after lunch in the community center, our small team started a new routine to see how light changed every corner. While working, my friend Lina adjusted the schedule so the plan stayed realistic and the process felt almost playful. By the end, the small effort felt meaningful and the sense of progress stayed with me","glossary":[{"word":"clarity","meaning":"quality of being clear"},{"word":"priority","meaning":"most important thing"},{"word":"feedback","meaning":"information about how you did"}]}]